tutorials/pressureDriven/precursor/zeroGradInletOutlet/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/ABLConditions"
 
internalField   uniform $epsilonInit;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    ground
    {
        type            atmEpsilonWallFunction;
        Cmu             $Cmu;
        kappa           $kappa;
        z0	        $z0;
        value           $internalField;
    }

    top
    {
        //type            fixedGradient;
        //value		uniform $topEpsilonGradient;
        
        // An alternative if the height of the domain is sufficient
        type            zeroGradient;
    }

    sides
    {
        type            empty;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
