tutorials/pressureDriven/precursor/zeroGradInletOutlet/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

#include      "include/ABLConditions"
 
internalField   uniform $nutInit;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    ground
    {
        type            atmNutkWallFunction;
        kappa           $kappa;
        Cmu             $Cmu;
        z0              $z0;
        value           uniform 0.0;
    }

    top
    {
        type            calculated;
        value           uniform 0;
    }

    sides
    {
        type            empty;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
